package model

import androidx.annotation.DrawableRes
//import androidx.compose.ui.tooling.data.EmptyGroup
import com.example.zoo.R

data class Animal(
    val name: String,
    @DrawableRes val image: Int?,
    val description: String
)

class Repo(

    val tabs: List<String> = listOf("Хищные", "Птицы", "Насекомые"),

    val animalList01: List<Animal> = listOf(
        Animal(
            name = "Лев",
            image = R.drawable.lion,
            description = "Один из самых крупных представителей семейства кошачьих. Масса самца 180-227 кг. Резко выражен половой диморфизм. Самец имеет длинную гриву, покрывающую шею, плечи и грудь."
        ),
        Animal(
            name = "Aмурский тигр",
            image = R.drawable.amurskiitigr,
            description = "Амурский тигр — властелин огромных территорий, площадь которых у самки составляет 300—500 км², а у самца — 600—800 км². Если в пределах своих владений корма достаточно, то тигр не покидает свою территорию."
        ),
        Animal(
            name = "Леопард",
            image = R.drawable.leopard,
            description = "Обитают эти хищные кошки в тропиках и субтропиках. Леопарды широко распространены на территории Африки и Азии. В России этот хищник встречается довольно редко, в основном в Закавказье и на Дальнем Востоке."
        ),
        Animal(
            name = "Пума",
            image = R.drawable.puma,
            description = "Пу́ма или горный лев, кугуар – самый крупный представитель рода пум. Длина тела животного составляет 100—180 см, при длине хвоста 60—75 см. Обитает в Северной и Южной Америке. Ареал пумы простирается от Канады и США на юг, охватывая почти всю Южную Америку вплоть до Патагонии."
        ),
        Animal(
            name = "Ягуар",
            image = R.drawable.jaguar,
            description = "Один из крупнейших хищников Северной и Южной Америки. Его тело длиной от 112 до 182 см, хвост вырастает до 75 см. Весит в среднем 60 - 90 кг.\n" +
                    "Охотничья территория одного зверя напоминает треугольник, площадью примерно до 170 кв. км. Ягуар охотится не сразу по всей своей территории, а на ее части. Сначала несколько дней в одной, а потом кочует в другую."
        ),
        Animal(
            name = "Рысь сибирская",
            image = R.drawable.rusi,
            description = "Рыси – это единственный вид кошек, которые обитают в северных районах нашей планеты. В России сибирская рысь встречается в районе Сахалина и Камчатки, но основным ареалом обитания считается сибирская тайга."

        ),
        Animal(
            name = "Бурый медведь",
            image = R.drawable.beer,
            description = "В Западной Европе разобщённые популяции бурого медведя сохранились на Пиренеях, Альпах и Апеннинах, в России ареал занимает почти всю лесную зону, за исключением её южных районов. Места обитания – леса с буреломом, перемежающиеся болотами, лужайками, водоёмами."
        ),
    ),

    val animalList02: List<Animal> = listOf(
        Animal(
            name = "Огненный гомрай",
            image = R.drawable.fire,
            description = "Птицы-носороги получили своё название из-за больших длинных клювов, резко загнутых вниз и имеющих у своего основания значительные выросты различной формы. Края клюва с неправильными зазубринами."
        ),
        Animal(
            name = "Белый павлин",
            image = R.drawable.white,
            description = "Вариция обыкновенного павлина. Белый павлин — большая и стройная птица. Характерным признаком самца павлина является сильное развитие верхних кроющих перьев, ошибочно принимаемых за хвост. Большой «хвост» на самом деле — перья надхвостья, сам же хвост состоит из невзрачных серых перьев."
        ),
        Animal(
            name = "Ушастая сова",
            image = R.drawable.sova,
            description = "Отличается от болотной совы большими ушными пучками, состоящими из 6 перьев, более коротким первым маховым пером (короче четвёртого) и окраской. Область её гнездования занимает Европу и северную Азию; зимует — в северной Африке."
        ),
        Animal(
            name = "Филин",
            image = R.drawable.filin,
            description = "Хищная птица из семейства совиных, один из наиболее крупных представителей отряда совообразных. Наиболее характерные черты включают в себя массивное «бочкообразное» телосложение, рыхлое оперение с преобладанием рыжеватых и охристых оттенков, ярко-оранжевые глаза и пучки удлинённых перьев над ними (так называемые «перьевые уши»)."
        ),
        Animal(
            name = "Серая цапля",
            image = R.drawable.zapla,
            description = "Это длинноногая, длинношеяя птица, серой окраски сверху и белой снизу, с включениями чёрного цвета, с довольно длинным острым клювом. Размеры достаточно большие, вес взрослого самца может достигать 2 кг. Самки несколько меньше самцов."
        ),
        Animal(
            name = "Ястреб-тетеревятник",
            image = R.drawable.yastreb,
            description = "Распространён в Европе, Северной Азии, Северной Америке. Довольно крупная птица, самка намного крупнее самца. Длина тела достигает 52-68 см, вес от 0,7 до 1,5 кг. Окраска верхней стороны тела – серовато-бурая (разных оттенков)."
        ),
    ),

    val animalList03: List<Animal> = listOf(
        Animal(
            name = "Большой мучной хрущак",
            image = R.drawable.sheet1,
            description = "Мучные черви — его личиночная форма. Личинка длиной до 2,5 см и более, голая, буровато-жёлтая, цилиндрическая, безглазая, с тремя парами грудных ножек, каждая ножка с коготком."
        ),
        Animal(
            name = "Таракан американский",
            image = R.drawable.sheet2,
            description = "Родом из тропических районов Африки. Длина тела имаго 35—50 мм. Самцы кажутся длиннее самок, поскольку крылья самцов заходят за кончик брюшка на 4—8 мм. Насекомое может летать. Питаются разлагающимся органическим материалом."
        ),
        Animal(
            name = "Таракан мадагаскарский",
            image = R.drawable.sheet3,
            description = "Один из самых больших тараканов в мире: средние размеры самки и самца — 60 и 55 мм соответственно. В некоторых случаях особи достигают 10 сантиметров в длину. Обитает на стволах и ветвях деревьев и кустов. Питаются травянистыми частями растений и фруктами."
        ),
        Animal(
            name = "Таракан пепельный",
            image = R.drawable.sheet4,
            description = "Размеры: самка — 30 мм, самец — 25 мм. Развитие до имагинальной стадии длится до 4 месяцев. Самку от самца можно отличить по размеру брюшка: у самок оно к концу шире, чем у самцов. Питаются фруктами или овощами, из сухих кормов отлично зарекомендовали себя овсяная крупа и гранулированный комбикорм для кроликов на основе травяной муки."
        ),
        Animal(
            name = "Паук-птицеед",
            image = R.drawable.pavuk,
            description = "Взрослые особи характеризуются крупными размерами, в некоторых случаях превышая 27 см в размахе ног. Птицееды населяют все континенты, кроме Антарктиды. Основу рациона пауков-птицеедов составляют насекомые или более мелкие пауки."
        ),

        ),

    val animalsList: List<List<Animal>> = listOf(animalList01, animalList02, animalList03),

    )

